Autodesk.Revit.DB.ElevationMarker.CreateReferenceElevation(Autodesk.Revit.DB.Document,System.Int32,Autodesk.Revit.DB.ElementId)
Creates a reference elevation on the ElevationMarker at the desired index.
document:
The document to which the new reference elevation will be added.
index:
The index on the ElevationMarker where the reference elevation will be placed.
viewIdToReference:
The view which will be referenced.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The ElementId viewIdToReference does not correspond to a View.
-or-
This view cannot be referenced by elevations.
-or-
index is occupied or out of range.
-or-
Elevation view creation is not allowed in this family.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Only reference elevations can be hosted on this ElevationMarker.
Throws Autodesk.Revit.Exceptions.ModificationForbiddenException:
The document is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
-or-
The document is being loaded, or is in the midst of another
sensitive process.
Throws Autodesk.Revit.Exceptions.ModificationOutsideTransactionException:
The document has no open transaction.
Since:
2013

Autodesk.Revit.DB.ElevationMarker.CreateElevation(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementId,System.Int32)
Creates a new elevation ViewSection on the ElevationMarker at the desired index.
Remarks:
The ViewFamilyType for the new elevation ViewSection is inherited from the ElevationMarker.
The new elevation ViewSection will receive a unique view name.
document:
The document to which the new elevation ViewSection will be added.
viewPlanId:
The id of a ViewPlan in which the ElevationMarker is visible.  The new elevation ViewSection will derive its extents
and inherit settings from the ViewPlan.
index:
The index on the ElevationMarker where the new elevation ViewSection will be placed.
The index on the ElevationMarker must be valid and unused.
View direction is determined by the index.
Returns:
The new elevation ViewSection.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The ElementId viewPlanId does not correspond to a ViewPlan.
-or-
index is occupied or out of range.
-or-
Elevation view creation is not allowed in this family.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Only reference elevations can be hosted on this ElevationMarker.
Throws Autodesk.Revit.Exceptions.ModificationForbiddenException:
The document is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
-or-
The document is being loaded, or is in the midst of another
sensitive process.
Throws Autodesk.Revit.Exceptions.ModificationOutsideTransactionException:
The document has no open transaction.
Since:
2013

Autodesk.Revit.DB.ElevationMarker.CreateReferenceElevationMarker(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.XYZ,Autodesk.Revit.DB.ElementId)
Creates a new ElevationMarker.
document:
The document to which the new ElevationMarker will be added.
viewFamilyTypeId:
This ViewFamilyType will be used by all elevations hosted on the new ElevationMarker.
origin:
The desired origin for the ElevationMarker.
viewPlanId:
The ViewPlan in which the reference ElevationMarker will appear.  Reference ElevationMarkers only appear in one view.
Returns:
The new ElevationMarker.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The ElementId viewPlanId does not correspond to a ViewPlan.
-or-
This view family type is not appropriate for ElevationMarkers.
-or-
Elevation view creation is not allowed in this family.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2013

Autodesk.Revit.DB.ElevationMarker.CreateElevationMarker(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.XYZ,System.Int32)
Creates a new ElevationMarker.
document:
The document to which the new ElevationMarker will be added.
viewFamilyTypeId:
This ViewFamilyType will be used by all elevations hosted on the new ElevationMarker.
origin:
The desired origin for the ElevationMarker.
initialViewScale:
This view scale will be automatically applied to new elevations created on the ElevationMarker.
The scale is the ratio of true model size to paper size.
Returns:
The new ElevationMarker.
Throws Autodesk.Revit.Exceptions.ArgumentException:
This view family type is not appropriate for ElevationMarkers.
-or-
The denominator X of the view scale 1/X must be in the range 1 to 24,000.
-or-
Elevation view creation is not allowed in this family.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2013